Rails/depot2/app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = 4
---
  def destroy
    @cart = current_cart
    #@cart = Cart.find(params[:id])
    @cart.destroy