Rails/depot2/app/controllers/line_items_controller.rb

  def create
    @cart =current_cart
    product=Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2013-06-11 20:06:40.832527', '2013-06-11 20:06:40.832527')
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (NULL, 2, '2013-05-24 21:42:55.400702', '2013-05-24 21:42:55.400702', 1)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-06-03 00:13:36.439398' WHERE "line_items"."id" = 11