Rails/depot2/app/controllers/store_controller.rb

  def index
    @products=Product.all #the local variable products is an array of all the product
---
SELECT "products".* FROM "products" ORDER BY title